title: DevelNext execution
id: 7c4f6537-b7c1-4326-a337-9a7aaa785d32
status: experimental
description: Detects process injection into BitLockerToGo (mainly used by LummaC2)
references:
    - https://trac-labs.com
author: RussianPanda
date: 2024-11-27
tags:
    - TA0002
logsource:
    category: application
    product: windows
detection:
    selection:
       Image|endswith: '\javaw.exe'
    selection1:
        - CommandLine|contains: 'org.develnext.jphp.ext.javafx.FXLauncher'
    condition: selection and selection1
falsepositives:
    - Unknown
level: critical
