title: Injection into explorer.exe
id: a7188ad2-6a2b-46a5-a54a-9d28ac37e949
status: experimental
description: Detects explorer.exe process injection (LegionLoader)
references:
    - https://securelist.com/satacom-delivers-cryptocurrency-stealing-browser-extension/109807/
author: RussianPanda
date: 2024-10-08
tags:
    - attack.t1055
logsource:
    category: process_tampering
    product: windows
detection:
    selection:
        ParentCommandLine|endswith: "C:\\WINDOWS\\SysWOW64\\explorer.exe explorer.exe"
    condition: selection
falsepositives:
    - Unknown
level: critical
